Revit 2027 API
ImageInstance.CanHaveSnaps Property
 When true the ImageInstance has snaps that can be enabled with the EnableSnaps property
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanHaveSnaps { get; }
Public ReadOnly Property CanHaveSnaps As Boolean
	Get
public:
property bool CanHaveSnaps {
	bool get ();
}
member CanHaveSnaps : bool with get
Property Value
Boolean
Remarks
 Snaps are only available for images based on PDF files that are vector based.
See Also
Reference
ImageInstance Class
Autodesk.Revit.DB Namespace